Revit 2027 API
MEPNetworkIterator.Start Method
 Gets the first step of network iteration.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Start()
Public Sub Start
public:
void Start()
member Start : unit -> unit
Remarks
 The first step may not contain any analytical segment, but the first analytical node.
See Also
Reference
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace